<?php

echo <<<'EOD'
<pre><b>
26) Задан массив $arr= array(0=>1.2, 1=>3, 2=>-3.2, 4=>1.34, 5=>-0.3, 6=>1.2, 7=>1.93, 8=>0.67). 
Отсортировать и вывести массив по возрастанию элементов.</b>
    
----------------------------------------------------------------------------------------------------------------------

Ответ: 

echo "По ключу </br>";
$arr=array(0=>1.2, 1=>3, 2=>-3.2, 4=>1.34, 5=>-0.3, 6=>1.2, 7=>1.93, 8=>0.67);
foreach ($arr as $key=>$value) {
    print "Элемент $key = $value \n";
}

echo "</br>По значению </br>";
$arr=array(0=>1.2, 1=>3, 2=>-3.2, 4=>1.34, 5=>-0.3, 6=>1.2, 7=>1.93, 8=>0.67);
natsort($arr);
foreach ($arr as $key=>$value) {
    print "Ключ=$key | Значение=$value\n";
}

----------------------------------------------------------------------------------------------------------------------

После выполнения кода:


EOD;
echo "По ключу </br>";
$arr=array(0=>1.2, 1=>3, 2=>-3.2, 4=>1.34, 5=>-0.3, 6=>1.2, 7=>1.93, 8=>0.67);
foreach ($arr as $key=>$value) {
    print "Элемент $key = $value \n";
}

echo "</br>По значению </br>";
$arr=array(0=>1.2, 1=>3, 2=>-3.2, 4=>1.34, 5=>-0.3, 6=>1.2, 7=>1.93, 8=>0.67);
natsort($arr);
foreach ($arr as $key=>$value) {
    print "Ключ=$key | Значение=$value\n";
}