<?php
echo <<<'EOD'
<pre><b>
2) Вывести количество элементов массива.
$box=array(1=>'помидор', '2'=>'яблоко', '1key'=>'груша', 'персик', true=>'апельсин');</b>

----------------------------------------------------------------------------------------------------------------------<br/>

Ответ: 

$box=array(1=>'помидор', '2'=>'яблоко', '1key'=>'груша', 'персик', true=>'апельсин');
$result=count($box);
echo "Количество элементов массива = $result";

----------------------------------------------------------------------------------------------------------------------<br/>

После выполнения кода:
EOD;

$box=array(1=>'помидор', '2'=>'яблоко', '1key'=>'груша', 'персик', true=>'апельсин');
$result=count($box);
echo "<pre>Количество элементов массива = $result";

?>

