<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Задание 1</title>
    <link rel="shortcut icon" href="../favicon.ico" type="image/x-icon">
</head>
<body>

<pre><b>
1) С помощью функции list вывести в переменной  vegetable первый элемент массива - помидор.
$box=array('помидор', 'яблоко');</b>

----------------------------------------------------------------------------------------------------------------------<br/>

Ответ: 

$box=array('помидор', 'яблоко');
list($vegetable)=$box;
echo "Ответ: первый элемент массива - $vegetable";

----------------------------------------------------------------------------------------------------------------------<br/>

После выполнения кода:

<?php

$box=array('помидор', 'яблоко');
list($vegetable)=$box;
echo "<pre>Первый элемент массива - $vegetable";

?>

</body>
</html>
