<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Задание 19</title>
    <link rel="shortcut icon" href="../favicon.ico" type="image/x-icon">
</head>
<body>

<pre><b>
19) Какие ключи и значения содержит массив $c?
echo "\n" . 'Ответ 19. ';

        $a=1;
        $p="a";
        define("b", 2);
        
        $c[]=$p;            //c[0] => "a";
        $c[$p]=$a;          //c["a"] => 1;
        $c[b]=$p;            //c[2] => "a";
        $c[]="a";            //c[3] => "a";
        $c[$a]=b;            //c[1] => 2;
        var_dump($c);
        
        for ($i=0; $i <= b; $i++) {
            if ($c[$i] == "a") {        //c[0]=="a"
                $c[$i]="aa";              //теперь c[0]=="aа"
                break;                       //с помощью "break" можно досрочно завершить цыкл, поэтому c[2] и c[3] не изменят свои значения.
            }
        }
        var_dump($c);</b>

----------------------------------------------------------------------------------------------------------------------

Ответ: 

0 => "aa"; "a" => 1; 2 => "a"; 3 => "a"; 1 => 2;
----------------------------------------------------------------------------------------------------------------------

После выполнения кода:

<?php

$a=1;
$p="a";
define("b", 2);

$c[]=$p;
$c[$p]=$a;
$c[b]=$p;
$c[]="a";
$c[$a]=b;
echo "До преобразования:";
var_dump($c);

for ($i=0; $i <= b; $i++) {
    if ($c[$i] == "a") {
        $c[$i]="aa";
        break;
    }
}
echo "После преобразования:";
var_dump($c);

?>

</body>
</html>


