<?php

echo <<<'EOD'
<pre><b>
25) Задан массив $arr= array(0=>1, 1=>-3, 2=>-9, 4=>1, 5=>3, 6=>12, 7=>-1, 8=>0). 
Вычислить сумму всех элементов массива с нечетными индексами.</b>
    
----------------------------------------------------------------------------------------------------------------------

Ответ: 

$sum=0;
$arr=array(0=>1, 1=>-3, 2=>-9, 4=>1, 5=>3, 6=>12, 7=>-1, 8=>0);
foreach ($arr as $key=>$value) {
    if ($key % 2) {
        $sum=$sum + $value;
        echo "\n Значение элемента с индексом $key = $value";
    }
}
print "\n Сумма = " . $sum;

----------------------------------------------------------------------------------------------------------------------

После выполнения кода:


EOD;
$sum=0;
$arr=array(0=>1, 1=>-3, 2=>-9, 4=>1, 5=>3, 6=>12, 7=>-1, 8=>0);
foreach ($arr as $key=>$value) {
    if ($key % 2) {
        $sum=$sum + $value;
        echo "\n Значение элемента с индексом $key = $value";
    }
}
print "\n Сумма = " . $sum;