<?php

echo <<<'EOD'
<pre><b>
30) Измените "W" из строки $string на "Q".
Не используйте строковые функции.</b>    

----------------------------------------------------------------------------------------------------------------------

Ответ: 

$string='Winter is coming!';
$string[0]="Q";
echo $string;

----------------------------------------------------------------------------------------------------------------------

После выполнения кода:

EOD;

$string='Winter is coming!';
$string[0]="Q";
echo $string;
