<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Задание 23</title>
    <link rel="shortcut icon" href="../favicon.ico" type="image/x-icon">
</head>
<body>

<pre><b>
23) Используя цикл for вывести все нечетные числа от 1 до 59 (в столбик).</b>

----------------------------------------------------------------------------------------------------------------------

Ответ: 

for ($i=0; $i <= 59; $i++) {
		    if ($i % 2) {
			echo $i . "\n";
		    }
		}

----------------------------------------------------------------------------------------------------------------------

После выполнения кода:

<?php

for ($i=0; $i <= 59; $i++) {
    if ($i % 2) {
        echo $i . "\n";
    }
}

?>

</body>
</html>