<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Задание 2</title>
    <link rel="shortcut icon" href="../favicon.ico" type="image/x-icon">
</head>
<body>

<pre><b>
2) Вывести количество элементов массива.
$box=array(1=>'помидор', '2'=>'яблоко', '1key'=>'груша', 'персик', true=>'апельсин');</b>

----------------------------------------------------------------------------------------------------------------------<br/>

Ответ: 

$box=array(1=>'помидор', '2'=>'яблоко', '1key'=>'груша', 'персик', true=>'апельсин');
$result=count($box);
echo "Количество элементов массива = $result";

----------------------------------------------------------------------------------------------------------------------<br/>

После выполнения кода:

<?php

$box=array(1=>'помидор', '2'=>'яблоко', '1key'=>'груша', 'персик', true=>'апельсин');
$result=count($box);
echo "<pre>Количество элементов массива = $result";

?>

</body>
</html>

