<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Задание 14</title>
    <link rel="shortcut icon" href="../favicon.ico" type="image/x-icon">
</head>
<body>

<pre><b>
14) Вывести фразу "You are beautiful", при этом  использовать строковый оператор.</b>

----------------------------------------------------------------------------------------------------------------------<br/>

Ответ: 

echo "\"You are beautiful\""
Необходимо экранировать элементы.
----------------------------------------------------------------------------------------------------------------------<br/>

После выполнения кода:

<?php

echo "\"You are beautiful\"";

?>

</body>
</html>
