<?php

echo <<<'EOD'
<pre><b>
13) Что выведет var_dump($var1 == $var2), почему?

		$var1 = array("pen", "pencil", "table");
		$var2 = array(1 => "pencil", 2 => "table", 0 => "pen");
		var_dump($var1 == $var2);</b>
		
----------------------------------------------------------------------------------------------------------------------<br/>

Ответ: 

bool(true)
В данном примере массивы равны, 
так как каждый элемент массива $var1 (ключ/значение) = элементам массива $var2 (ключ/значение)

----------------------------------------------------------------------------------------------------------------------<br/>

После выполнения кода:

EOD;

$var1 = array("pen", "pencil", "table");
$var2 = array(1 => "pencil", 2 => "table", 0 => "pen");
var_dump($var1 == $var2);

