<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Задание 5</title>
    <link rel="shortcut icon" href="../favicon.ico" type="image/x-icon">
</head>
<body>

<pre><b>
5) Что будет в результате сравнения, почему?
var_dump('hi' >= 'hi');</b>

----------------------------------------------------------------------------------------------------------------------<br/>

Ответ: 

Проверям равенства двух значений по обе стороны от оператора, 
в данном примере нам вернет true, так как 'hi' = 'hi'

----------------------------------------------------------------------------------------------------------------------<br/>

После выполнения кода:

<?php

var_dump('hi' >= 'hi');

?>

</body>
</html>
