<?php

echo <<<'EOD'
<pre><b>
1) С помощью функции list вывести в переменной  vegetable первый элемент массива - помидор.
$box=array('помидор', 'яблоко');</b>

----------------------------------------------------------------------------------------------------------------------<br/>

Ответ: 

$box=array('помидор', 'яблоко');
list($vegetable)=$box;
echo "Ответ: первый элемент массива - $vegetable";

----------------------------------------------------------------------------------------------------------------------<br/>

После выполнения кода:
EOD;

$box=array('помидор', 'яблоко');
list($vegetable)=$box;
echo "<pre>Первый элемент массива - $vegetable";

?>