<?php

echo <<<'EOD'
<pre><b>
14) Вывести фразу "You are beautiful", при этом  использовать строковый оператор.</b>

----------------------------------------------------------------------------------------------------------------------<br/>

Ответ: 

echo "\"You are beautiful\""
Необходимо экранировать элементы.
----------------------------------------------------------------------------------------------------------------------<br/>

После выполнения кода:

EOD;

echo "\"You are beautiful\"";

