<?php

echo <<<'EOD'
<pre><b>
18) Преобразовать $a="abradсabra" в "abracbra"(удалить символ "d" и третью букву "a").</b>

----------------------------------------------------------------------------------------------------------------------

Ответ: 

$$a = "abradсabra";
		echo str_replace("dсa", "c", $a);

//Функция str_replace — Заменяет все вхождения строки поиска на строку замены (что/на что/количество)

----------------------------------------------------------------------------------------------------------------------

После выполнения кода:

EOD;
$a = "abradсabra";
echo str_replace("dсa", "c", $a);