<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Задание 26</title>
    <link rel="shortcut icon" href="../favicon.ico" type="image/x-icon">
</head>
<body>

<pre><b>
26) Задан массив $arr= array(0=>1.2, 1=>3, 2=>-3.2, 4=>1.34, 5=>-0.3, 6=>1.2, 7=>1.93, 8=>0.67). 
Отсортировать и вывести массив по возрастанию элементов.</b>
    
----------------------------------------------------------------------------------------------------------------------

Ответ: 

echo "По ключу </br>";
$arr=array(0=>1.2, 1=>3, 2=>-3.2, 4=>1.34, 5=>-0.3, 6=>1.2, 7=>1.93, 8=>0.67);
foreach ($arr as $key=>$value) {
    print "Элемент $key = $value \n";
}

echo "</br>По значению </br>";
$arr=array(0=>1.2, 1=>3, 2=>-3.2, 4=>1.34, 5=>-0.3, 6=>1.2, 7=>1.93, 8=>0.67);
natsort($arr);
foreach ($arr as $key=>$value) {
    print "Ключ=$key | Значение=$value\n";
}

----------------------------------------------------------------------------------------------------------------------

После выполнения кода:

<?php

echo "По ключу </br>";
$arr=array(0=>1.2, 1=>3, 2=>-3.2, 4=>1.34, 5=>-0.3, 6=>1.2, 7=>1.93, 8=>0.67);
foreach ($arr as $key=>$value) {
    print "Элемент $key = $value \n";
}

echo "</br>По значению </br>";
$arr=array(0=>1.2, 1=>3, 2=>-3.2, 4=>1.34, 5=>-0.3, 6=>1.2, 7=>1.93, 8=>0.67);
natsort($arr);
foreach ($arr as $key=>$value) {
    print "Ключ=$key | Значение=$value\n";
}

?>

</body>
</html>