<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Задание 16</title>
    <link rel="shortcut icon" href="../favicon.ico" type="image/x-icon">
</head>
<body>

<pre><b>
16) Тремя способами преобразовать переменную $var в строку.</b>

----------------------------------------------------------------------------------------------------------------------

Ответ: 

$var = "'Я переменная'";

		echo "Вариант №1 $var";           //Выводит одну или более строк
		print "Вариант №2 $var";           //Выводит строку
		print_r("Вариант №3 $var");        //Выводит удобочитаемую информацию о переменной
----------------------------------------------------------------------------------------------------------------------

После выполнения кода:

<?php

$var = "'Я переменная'";

echo "\nВариант №1 $var";
print "\nВариант №2 $var";
print_r("\nВариант №3 $var");

?>

</body>
</html>