<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Задание 7</title>
    <link rel="shortcut icon" href="../favicon.ico" type="image/x-icon">
</head>
<body>

<pre><b>
7) Вывести кол-во повторений каждого элемента в массиве:
$B = array("pen", "pensil", "pen", "book", "pensil");</b>

----------------------------------------------------------------------------------------------------------------------<br/>

Ответ: 

print_r(array_count_values($B));
Самый быстрый способ с помощью функция array_count_values().
Функция возвращает массив, ключами которого являются значения массива array, 
а значениями - количество повторений значений array.
Функция print_r - выводит читабельную информацию.

----------------------------------------------------------------------------------------------------------------------<br/>

После выполнения кода:

<?php

$B = array("pen", "pensil", "pen", "book", "pensil");
print_r(array_count_values($B));

?>

</body>
</html>
