<?php

echo <<<'EOD'
<pre><b>
5) Что будет в результате сравнения, почему?
var_dump('hi' >= 'hi');</b>

----------------------------------------------------------------------------------------------------------------------<br/>

Ответ: 

Проверям равенства двух значений по обе стороны от оператора, 
в данном примере нам вернет true, так как 'hi' = 'hi'

----------------------------------------------------------------------------------------------------------------------<br/>

После выполнения кода:

EOD;
var_dump('hi' >= 'hi');
?>
